---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalSolarHeatGainCoefficient
source: html/4848c616-d77b-0b33-3aa6-dd6bd0311d4f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalSolarHeatGainCoefficient Property

"Solar Heat Gain Coefficient"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalSolarHeatGainCoefficient { get; }
```